Autodesk.Revit.DB.Mechanical.DuctLining.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Double)
Creates a new instance of duct lining.
document:
The document.
ductOrContentElementId:
The duct, fitting or accessory ElementId to which lining will be added.
ductLiningTypeId:
The duct lining type.
If the input duct lining type is InvalidElementId, the default lining type from the document will be used.
Thickness:
The thickness of the lining.
Returns:
The newly created duct lining.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This id does not represent a duct, fitting, or accessory element.
-or-
This duct Lining type is invalid.
-or-
Thickness is not valid for assignment to insulation or lining elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2012

Autodesk.Revit.DB.Mechanical.DuctLining
Represents Lining applied to the inside of a given duct, fitting or accessory.
Since:
2012